# **Practice 12: Loops - Apply Family**

#### **WRITE YOUR NAME HERE**

---

**IMPORTANT**:
- Before starting the lab, save a copy to your google drive by navigating to `File > Save a copy in Drive` <br>

<br>


**Instructions**: Complete the lab below.

- <font color=red>Tasks</font> indicated in red must be completed to receive credit
- Include all code for your work
- Include markdown cells with written answers explaining your work when prompted
- **NOTE: Your completed lab must be submitted to Canvas as a .ipynb file by the end of the lab session**
---

<br>

####<font color=red>Organized</font>

**Answers should be organized in the following format for organization and readability**

<font color=red>Example task 1</font>

In [ ]:
# 1.

# This will be the code block to answer the first part of a task

1. This will be the text answer/explanation (if prompted) for the first task

<font color=red>Example task 2</font>

In [ ]:
# 2.

# This will be the code block to answer the second part of a task

2. This will be the text answer/explanation (if prompted) for the second task

<br>

Continue this format for the remaining subtasks

<br>

---

<br>

#### Packages

In [ ]:
# none

<br>

<br>

<br>

---

####<font color=red>Task 1</font> - Loading and Preprocessing the Dataset

<font color=red>Task 1.1</font> Today, we'll be working with salary data available online.

* Run the following script to load the salary dataset for today's assignment.

```
# load data frame
data_url                       <- "https://raw.githubusercontent.com/khasenst/datasets_teaching/refs/heads/main/salary_data.csv"
salary                         <- na.omit(read.csv(data_url, header = TRUE))

# convert character variables to factors
salary$Gender                  <- as.factor(salary$Gender)
salary$Education.Level         <- as.factor(salary$Education.Level)
salary$Job.Title               <- as.factor(salary$Job.Title)

# reassign levels
levels(salary$Education.Level) <-  c("missing", "BS", "BS", "HS",
                                     "MS", "MS", "PhD", "PhD")
salary$Education.Level         <- factor(salary$Education.Level, levels = c("missing", "HS", "BS", "MS", "PhD"))
```

In [1]:
# load data frame
data_url                       <- "https://raw.githubusercontent.com/khasenst/datasets_teaching/refs/heads/main/salary_data.csv"
salary                         <- na.omit(read.csv(data_url, header = TRUE))

# convert character variables to factors
salary$Gender                  <- as.factor(salary$Gender)
salary$Education.Level         <- as.factor(salary$Education.Level)
salary$Job.Title               <- as.factor(salary$Job.Title)

# reassign levels
levels(salary$Education.Level) <-  c("missing", "BS", "BS", "HS",
                                     "MS", "MS", "PhD", "PhD")
salary$Education.Level         <- factor(salary$Education.Level, levels = c("missing", "HS", "BS", "MS", "PhD"))

<br>

<font color=red>Task 1.2</font> View the first few lines of the `salary` data frame using the `head()` function.

In [2]:
head(salary)

  Age Gender Education.Level Job.Title         Years.of.Experience Salary
1 32  Male   BS              Software Engineer  5                   90000
2 28  Female MS              Data Analyst       3                   65000
3 45  Male   PhD             Senior Manager    15                  150000
4 36  Female BS              Sales Associate    7                   60000
5 52  Male   MS              Director          20                  200000
6 29  Male   BS              Marketing Analyst  2                   55000

<br>

<br>

<br>

---

####<font color=red>Task 2</font>

<font color=red>Task 2.1</font>

* Write a `for` loop that loops through each column in the `salary` data frame and prints the `class()` of each column

In [38]:
for(i in colnames(salary)){
  print(class(salary[[i]]))
}

[1] "integer"
[1] "factor"
[1] "factor"
[1] "factor"
[1] "numeric"
[1] "integer"

<br>

<font color=red>Task 2.2</font>

* Use `lapply()` to perform the same task from 2.1

In [8]:
lapply(salary,class)

$Age
[1] "integer"

$Gender
[1] "factor"

$Education.Level
[1] "factor"

$Job.Title
[1] "factor"

$Years.of.Experience
[1] "numeric"

$Salary
[1] "integer"

<br>

<font color=red>Task 2.3</font>

* Use `sapply()` to perform the same task from 2.1

In [9]:
sapply(salary,class)

                Age              Gender     Education.Level           Job.Title
          "integer"            "factor"            "factor"            "factor"
Years.of.Experience              Salary
          "numeric"           "integer"

<br>

<font color=red>Task 2.4</font>

* In a text cell, compare the outputs Tasks 2.1-2.3

**Task 2.4** <br>
* lapply() - returns a list of column classes.
* sapply() - returns a vector of column classes.

<br>

<br>

<br>

---

####<font color=red>Task 3</font>

<font color=red>Task 3.1</font>

* Store the columns of `salary` that are either `integer` or `numeric` class into another data frame called `salary_numeric`

In [42]:
salary_numeric <- salary[, sapply(salary, function(col) is.numeric(col) | is.integer(col))]
salary_numeric

     Age Years.of.Experience Salary
1    32   5                   90000
2    28   3                   65000
3    45  15                  150000
4    36   7                   60000
5    52  20                  200000
6    29   2                   55000
7    42  12                  120000
8    31   4                   80000
9    26   1                   45000
10   38  10                  110000
11   29   3                   75000
12   48  18                  140000
13   35   6                   65000
14   40  14                  130000
15   27   2                   40000
16   44  16                  125000
17   33   7                   90000
18   39  12                  115000
19   25   0                   35000
20   51  22                  180000
21   34   5                   80000
22   47  19                  190000
23   30   2                   50000
24   36   9                   60000
25   41  13                  140000
26   28   3                   45000
27   37  11                  110000
28   24   1                   40000
29   43  15                  140000
30   33   6                   90000
⋮    ⋮   ⋮                   ⋮
6675 46  14                  140000
6676 26   1                   35000
6677 42  13                  130000
6678 36  10                  100000
6679 24   1                   35000
6680 43  15                  150000
6681 27   2                   40000
6682 33   8                   80000
6683 28   4                   55000
6684 51  19                  190000
6685 37   7                   90000
6686 49  20                  200000
6687 32   3                   40000
6688 30   5                   70000
6689 46  16                  160000
6690 26   1                   35000
6691 42  13                  130000
6692 36   9                   95000
6693 24   1                   35000
6694 43  14                  140000
6695 27   2                   40000
6696 33   7                   90000
6697 28   4                   55000
6698 51  19                  190000
6699 37   6                   75000
6700 49  20                  200000
6701 32   3                   50000
6702 30   4                   55000
6703 46  14                  140000
6704 26   1                   35000

<br>

<font color=red>Task 3.2</font>

* Use `apply()` to calculate the average of each column in `salary_numeric`

In [41]:
apply(salary_numeric, 2, mean)

                Age Years.of.Experience              Salary
       3.362203e+01        8.095014e+00        1.153270e+05

<br>

<br>

<br>

---

####<font color=red>Task 4</font>

<font color=red>Task 4.1</font>

* Create a function called `calc_metrics` that calculates the mean and standard deviation of `numeric` or `integer` vector

* The function should return the mean and standard deviation as a vector of length 2 using the `c()` function

In [22]:
calc_metrics <- function(x){
  if(is.numeric(x) | is.integer(x)){
    return(c(mean = mean(x), sd= sd(x)))
  }else{
    return -1
  }
}

<br>

<font color=red>Task 4.2</font>

* Use the `tapply()` function to calculate the mean and standard devation of salary for each unique education level

* What is the `class()` of the output?

In [28]:
res <- tapply(salary$Salary, salary$Education.Level, calc_metrics)
#res
#class(res)

[1] "array"

<br>

<font color=red>Task 4.3</font>

* Use `do.call()` to "row bind" the output from Task 4.2

In [27]:
do.call(rbind, res)

        mean      sd
missing 100000.00       NA
HS       36706.69 22549.13
BS       95082.91 44091.79
MS      130112.06 40640.82
PhD     165651.46 34339.75

<br>

<font color=red>Task 4.4</font>

Convert your output from Task 4.3 into a data frame called `data_summary` with the following attributes:

* The data frame should have 2 columns. One column should be named `salary_mean` and the other column should be named `salary_sd`.

In [30]:
data_summary <- data.frame(do.call(rbind, res))
colnames(data_summary) <- c("salary_mean","salary_sd")
data_summary

        salary_mean salary_sd
missing 100000.00         NA
HS       36706.69   22549.13
BS       95082.91   44091.79
MS      130112.06   40640.82
PhD     165651.46   34339.75

<br>

<br>

<br>

---

####<font color=red>Task 5</font>

<font color=red>Task 5.1</font>

* Repeat Task 4, except using `Age` instead of `Salary` and `Job.Title` instead `Education.Level`

In [33]:
res_1 <- tapply(salary$Age, salary$Job.Title, calc_metrics)

data_summary_age <- data.frame(do.call(rbind, res_1))
colnames(data_summary_age) <- c("age_mean","age_sd")

data_summary_age

                                 age_mean age_sd
Account Manager                  32.00000        NA
Accountant                       31.00000        NA
Administrative Assistant         37.50000 2.1213203
Back end Developer               30.93443 5.9742075
Business Analyst                 33.50000 0.7071068
Business Development Manager     34.00000        NA
Business Intelligence Analyst    33.00000        NA
CEO                              50.00000        NA
Chief Data Officer               44.00000        NA
Chief Technology Officer         52.00000        NA
Content Marketing Manager        38.46575 9.0093812
Copywriter                       28.00000        NA
Creative Director                42.00000        NA
Customer Service Manager         44.50000 9.1923882
Customer Service Rep             27.00000        NA
Customer Service Representative  26.66667 2.6583203
Customer Success Manager         28.00000        NA
Customer Success Rep             26.00000        NA
Data Analyst                     28.68595 4.3354502
Data Entry Clerk                 25.00000        NA
Data Scientist                   36.06402 7.1443931
Delivery Driver                  24.00000 0.0000000
Developer                        27.00000        NA
Digital Content Producer         30.00000        NA
Digital Marketing Manager        32.13462 6.7418181
Digital Marketing Specialist     29.33333 0.4879500
Director                         52.00000        NA
Director of Business Development 47.00000        NA
Director of Data Science         44.47368 3.5862100
Director of Engineering          46.00000 1.4142136
⋮                                ⋮        ⋮
Senior Research Scientist        37.20408 2.1309191
Senior Researcher                46.00000        NA
Senior Sales Manager             45.50000 2.1213203
Senior Sales Representative      39.50000 0.7071068
Senior Scientist                 40.00000 3.4641016
Senior Software Architect        37.00000        NA
Senior Software Developer        38.00000 6.0827625
Senior Software Engineer         39.88115 6.4576981
Senior Training Specialist       40.00000        NA
Senior UX Designer               44.66667 0.5773503
Social Media Man                 26.00000        NA
Social Media Manager             26.64286 1.0818178
Social Media Specialist          28.00000        NA
Software Developer               26.90400 2.2768966
Software Engineer                28.31853 2.6176170
Software Engineer Manager        45.74202 8.3583054
Software Manager                 37.00000        NA
Software Project Manager         37.00000        NA
Strategy Consultant              41.00000        NA
Supply Chain Analyst             50.00000        NA
Supply Chain Manager             43.00000        NA
Technical Recruiter              36.00000        NA
Technical Support Specialist     28.00000        NA
Technical Writer                 27.00000        NA
Training Specialist              39.00000        NA
UX Designer                      34.00000        NA
UX Researcher                    27.00000        NA
VP of Finance                    47.00000        NA
VP of Operations                 47.00000        NA
Web Developer                    30.52874 4.0543949

<br>

<font color=red>Task 5.2</font>

* Order the summary from Task 5.1 in increasing order

* Which jobs have the youngest individuals on average? List the first two.

In [36]:
df <- data_summary_age[order(data_summary_age$age_mean),]
df

                                   age_mean age_sd
Receptionist                       23.64912 0.7194052
Delivery Driver                    24.00000 0.0000000
Junior Developer                   24.00000        NA
Juniour HR Coordinator             24.33333 0.5773503
Data Entry Clerk                   25.00000        NA
Help Desk Analyst                  25.00000        NA
Customer Success Rep               26.00000        NA
Junior Customer Support Specialist 26.00000        NA
Junior Data Scientist              26.00000        NA
Social Media Man                   26.00000        NA
Junior Software Engineer           26.33333 0.7916228
Junior Software Developer          26.53448 1.4535560
Sales Representative               26.55263 3.6885313
Sales Associate                    26.55714 3.3346478
Social Media Manager               26.64286 1.0818178
Customer Service Representative    26.66667 2.6583203
Sales Executive                    26.68421 4.9816163
Graphic Designer                   26.72727 0.7672969
Software Developer                 26.90400 2.2768966
Product Designer                   26.96000 1.2129927
Customer Service Rep               27.00000        NA
Developer                          27.00000        NA
Junior Research Scientist          27.00000        NA
Junior UX Designer                 27.00000        NA
Technical Writer                   27.00000        NA
UX Researcher                      27.00000        NA
Junior Sales Associate             27.15493 2.3316988
Junior HR Generalist               27.55000 2.6960423
Junior Sales Representative        27.58537 6.3244589
Junior Accountant                  27.66667 2.8867513
⋮                                  ⋮        ⋮
Customer Service Manager           44.50000 9.1923882
Senior Data Engineer               44.50000 0.5773503
Senior UX Designer                 44.66667 0.5773503
Director of Sales                  45.00000        NA
Operations Analyst                 45.00000        NA
Sales Operations Manager           45.00000        NA
Senior Manager                     45.50000 0.7071068
Senior Sales Manager               45.50000 2.1213203
Senior Data Analyst                45.66667 0.5773503
Software Engineer Manager          45.74202 8.3583054
Director of Engineering            46.00000 1.4142136
IT Manager                         46.00000        NA
Senior HR Manager                  46.00000 2.6457513
Senior Researcher                  46.00000        NA
Director of Business Development   47.00000        NA
VP of Finance                      47.00000        NA
VP of Operations                   47.00000        NA
Director of Product Management     48.00000        NA
Human Resources Director           48.00000        NA
Operations Director                48.00000        NA
Principal Engineer                 48.00000        NA
Director of Operations             48.09091 2.3432689
Director of Finance                48.50000 2.1213203
Director of Human Capital          49.00000        NA
CEO                                50.00000        NA
Director of Sales and Marketing    50.00000        NA
Supply Chain Analyst               50.00000        NA
Director of Human Resources        51.00000 0.0000000
Chief Technology Officer           52.00000        NA
Director                           52.00000        NA

In [37]:
head(df,2)

                age_mean age_sd
Receptionist    23.64912 0.7194052
Delivery Driver 24.00000 0.0000000